src/Documents/ГрафикиУборки/ГрафикиУборки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ГрафикиУборки</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.Календари</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДатыУборки</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <types>CatalogRef.Люди</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ГрафикиУборки/ManagerModule.bsl
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ГрафикУборки";
	КомандаПечати.Представление = НСтр("ru = 'График уборки'");
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм = "ФормаСписка,ФормаДокумента";
	КомандаПечати.Порядок = 1;	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ГрафикУборки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ГрафикУборки", 
			НСтр("ru = 'График уборки'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ГрафикУборки"));
		
	КонецЕсли;

КонецПроцедуры

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
		
	ПараметрыНоменклатуры	= Новый Структура;
	ТабличныйДокумент		= Новый ТабличныйДокумент;
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		//Если Не ПервыйДокумент Тогда
		//	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли;
		//ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "ГрафикУборки" Тогда
			
			//Шапка 
			Шапка = ИмяМакета.ПолучитьОбласть("Шапка");
			ТабличныйДокумент.Вывести(Шапка);
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ГрафикиУборки.Ссылка,
			|	ГрафикиУборки.ДатыУборки.(
			|		НомерСтроки,
			|		ФИО,
			|		Дата,
			|		НомерТелефона)
			|ИЗ
			|	Документ.ГрафикиУборки КАК ГрафикиУборки
			|ГДЕ
			|	ГрафикиУборки.Ссылка = &ТекущийДокумент";
			
			СтрТабЧасти = ИмяМакета.ПолучитьОбласть("Строка");
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
			КонецЦикла;
	
		КонецЕсли;
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции
